html/reversed-bollinger-band.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>逆向BollingerBand</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">逆向BollingerBand</h1>
<p>
使用bollinger band作为indicator，使用过去几天的收盘价来，来计算今天买入和卖出价格. 这两个价格正好是bollinger band的-1和+1的位置.
</p>

<div class="org-src-container">

<pre class="src src-Python">def reverse_bollinger_band(df_price, ratio=2):
    A = df_price.shape[0] + 1
    B = ratio
    mean = np.mean(df_price, axis=0)
    std = np.std(df_price, axis=0)
    C = (A - 1) * mean
    D = (A - 1) * (std ** 2 + mean ** 2)
    B2 = B ** 2
    a = (B2 - (A - 1)) * (A - 1)
    b = 2 * C * (A - B2 - 1)
    c = A * B2 * D - (B2 + 1) * (C ** 2)

    common = np.sqrt(b ** 2 - 4 * a * c)
    r0 = (common - b) * 0.5 / a
    r1 = (-common - b) * 0.5 / a
    return (r0, r1)
</pre>
</div>

<p>
UPDATE: 完全使用BollingerBand是有问题的。股价在下跌的过程中可能会有很多次buy signal, 但是如果资金不够多的话，只能完全前面几次buy操作，而后面却正是更低的价格。同样在上涨过程中会出现多次sell signal, 但是如果之前持有不够多的话，也会错过在高点卖出。
</p>
</div>
</body>
</html>
